---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoRoomBoundingElements
source: html/e316ae5e-bb60-06dd-3ed2-4446a88c1c7e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoRoomBoundingElements Property

Can't create any energy analysis surfaces. There are no Room bounding elements defined in the current phase. Please check the Project Information settings.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoRoomBoundingElements { get; }
```